--------------------------------------------------------------------------------
-- HV Rheostats (KF-47A11)
--------------------------------------------------------------------------------
-- Copyright (C) 2025 Metrostroi Team & Metrodolbaeb group
--------------------------------------------------------------------------------
Metrostroi.DefineSystem("KF_47A11")

function TRAIN_SYSTEM:Initialize()
    self.Resistors = {
        --ExtraR
        ["L2_L4"] = 1.14, --+
        ["L8_L13"] = 1.730, --+
        --R1
        ["P17_18"] = 0.12,--+
        ["P18_20"] = 0.19,--+
        ["P20_21"] = 0.22,--+ 
        ["P21_22"] = 0.22,--+
        ["P22_23"] = 0.19,--+
        ["P23_24"] = 0.144,--+
        ["P24_25"] = 0.144,--+
        ["P25_26"] = 0.716,--+
        --R2
        ["L12_P76"] = 0.24, --+
        ["L12_P27"] = 2.75, --+
        --R5
        ["L12_P16"] = 0.38,--+
        --R6
        ["P13_12"] = 0.485,--+
        ["P12_11"] = 0.945,--+ 
        ["P11_10"] = 0.144, --+
        ["P10_9"] = 0.144,--+
        ["P9_8"] = 0.19,--+
        ["P8_7"] = 0.22,--+
        ["P6_7"] = 0.22,--+
        ["P4_6"] = 0.12,--+
        ["P3_4"] = 0.144,--+
        --R7
        ["L8_P14"] = 1.92, --+
        --R8
        ["L8_P1"] =  0.485, --+              
    }
    self.ResistorTemperatures = {
        --ExtraR
        ["L2_L4"] = 1,
        ["L8_L13"] = 1,
        --R1
        ["P17_18"] = 1,
        ["P18_20"] = 1,
        ["P20_21"] = 1,
        ["P21_22"] = 1,
        ["P22_23"] = 1,
        ["P23_24"] = 1,
        ["P24_25"] = 1,
        ["P25_26"] = 1,
        --R2
        ["L12_P76"] = 1,
        ["L12_P27"] = 1,
        --R5
        ["L12_P16"] = 1,
        --R6
        ["P13_12"] = 1,
        ["P12_11"] = 1,
        ["P11_10"] = 1,
        ["P10_9"] = 1,
        ["P9_8"] = 1,
        ["P8_7"] = 1,
        ["P6_7"] = 1,
        ["P4_6"] = 1,
        ["P3_4"] = 1,
        --R7   
        ["L8_P14"] = 1,
        --R8
        ["L8_P1"] = 1,
        
    }
    self.Overheating = {}

    for k,v in pairs(self.Resistors) do
        self[k] = v
        self.Overheating[k] = 0
    end
end

function TRAIN_SYSTEM:Think(dT)
    -- Расчет резисторов с учетом температуры
    if self.Train.Electric then
        for k,v in pairs(self.ResistorTemperatures) do
            --Данные температуры
            local T = self.Train.Electric["T"..v] or 25
            local O = self.Train.Electric["Overheat"..v] or 0
            -- Новый номинал резисторов с учетом нагревания
            self[k] = self.Resistors[k]*(1.0 + 0.0001*(T-25) - math.log(1-O))
        end
    end
end