--------------------------------------------------------------------------------
-- Box with switches (YAK-37D)
--------------------------------------------------------------------------------
-- Copyright (C) 2025 Metrostroi Team & Metrodolbaeb group
--------------------------------------------------------------------------------
Metrostroi.DefineSystem("YAK_37D")

function TRAIN_SYSTEM:Initialize()
    
    -- КШ1 (ослабление возбуждения тяговых электродвигателей)
    self.Train:LoadSystem("KSH1","Relay","KPP-113",{bass=true})
    -- КПП (контактор первичного преобразователя БПСН)
    self.Train:LoadSystem("KPP","Relay","KPP-113", {bass=true})
    -- КШ2 (ослабление возбуждения тяговых электродвигателей)
    self.Train:LoadSystem("KSH2","Relay","KPP-113",{bass=true})
    -- Р1-5 (контактор включения провода 1) 
    self.Train:LoadSystem("R1_5","Relay","KPD-110",{bass=true})
    -- РРП2 (подача напряжения в цепь управления при резервном пуске)
    self.Train:LoadSystem("RRP2","Relay","KPD-110",{bass=true})
    --------------------------------------------------------------------------------
    -- КСБ1, КСБ2 (включение тиристорных ключей регулирования поля для тормозных режимов)
    self.Train:LoadSystem("KSB1","Relay","KPP-113",{bass=true})
    self.Train:LoadSystem("KSB2","Relay","KPP-113",{bass=true})
    -- ТР1 (переключение в цепях управления для перехода на тормозной режим)
    self.Train:LoadSystem("TR1","Relay","RPU3-114-T-UHLZA")
    --------------------------------------------------------------------------------
    
end